yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
/********************************************************************************/
/*!
	@file			LPC23xx_reg.h
	@author         Nemui Trinomius (http://nemuisan.blog.bai.ne.jp)
    @version        x.xx(Work In Progress)
    @date           20xx.xx.xx
	@brief          LPC23xx's Register Definitions.

    @section HISTORY
		20xx.xx.xx	Vx.xx	Start Here.

    @section LICENSE
		BSD License. See Copyright.txt
*/
/********************************************************************************/
#ifndef __LPC23xx_REG_H
#define __LPC23xx_REG_H	0x0XXX

#ifdef __cplusplus
 extern "C" {
#endif

/* Register Definition of MEMMAP */
typedef enum MEMMAP_enum
{
    MEMMAP_BOOTLOADER_MODE = (0UL<<0),  /* Interrupt vectors are re-mapped to Boot ROM. */
    MEMMAP_USERFLASH_MODE  = (1UL<<0),  /* Interrupt vectors are not re-mapped and reside in Flash.*/
    MEMMAP_USERRAM_MODE    = (2UL<<0),  /* Interrupt vectors are re-mapped to Static RAM. */
    MEMMAP_USEREXTMEMMODE  = (3UL<<0),  /* Improper setting of this value may result in
                                          incorrect operation of the device. */
} MEMMAP_t;
#define MEMMAP_bm	0x03


/* Register Definition of Reset Source Identification register */
typedef enum RSID_enum
{
    RSID_POR  = (1UL<<0),  /* Power On Reset  */
    RSID_EXTR = (1UL<<1),  /* External Reset  */
    RSID_WDTR = (1UL<<2),  /* WatchDog  Reset */
    RSID_BODR = (1UL<<3),  /* Brown Out Reset */
} RSID_t;
#define RSID_bm	0x0F

/* Register Definition of External Interrupt Flag register */
typedef enum EXTINT_enum
{
	/* In level-sensitive mode, this bit is set if the EINTx function is selected for its
	   pin, and the pin is in its active state. In edge-sensitive mode, this bit is set if
	   the EINT3 function is selected for its pin, and the selected edge occurs on
	   the pin.
	   This bit is cleared by writing a one to it, except in level sensitive mode when
	   the pin is in its active state */
    EXTINT_EXTINT0 = (1UL<<0),  /* This bit is cleared by writing a one to it, */
    EXTINT_EXTINT1 = (1UL<<1),  /* This bit is cleared by writing a one to it, */
    EXTINT_EXTINT2 = (1UL<<2),  /* This bit is cleared by writing a one to it, */
    EXTINT_EXTINT3 = (1UL<<3),  /* This bit is cleared by writing a one to it, */
} EXTINT_t;
#define EXTINT_ALL_bm	0x0F


/* Register Definition of EXTMODE */
typedef enum EXTMODE_enum
{
    EXTMODE0_LEVELSENSE = (0UL<<0),  /* Level-Sensitive   */
    EXTMODE0_EDGESENSE  = (1UL<<0),  /* Edge-Sensitive 	*/
    EXTMODE1_LEVELSENSE = (0UL<<1),  /* Level-Sensitive   */
    EXTMODE1_EDGESENSE  = (1UL<<1),  /* Edge-Sensitive 	*/
    EXTMODE2_LEVELSENSE = (0UL<<2),  /* Level-Sensitive   */
    EXTMODE2_EDGESENSE  = (1UL<<2),  /* Edge-Sensitive 	*/
    EXTMODE3_LEVELSENSE = (0UL<<3),  /* Level-Sensitive   */
    EXTMODE3_EDGESENSE  = (1UL<<3),  /* Edge-Sensitive 	*/
} EXTMODE_t;
#define EXTMODE_ALL_bm	0x0F
#define EXTMODE0_bm		(1UL<<0)
#define EXTMODE1_bm		(1UL<<1)
#define EXTMODE2_bm		(1UL<<2)
#define EXTMODE3_bm		(1UL<<3)


/* Register Definition of EXTPOLER */
typedef enum EXTPOLER_enum
{
    EXTPOLER0_LOW_OR_FALLING = (0UL<<0),  /* Low-Level  or Falling Edge Sensitive */
    EXTPOLER0_HIGH_OR_RISING = (1UL<<0),  /* High-Level or Rising  Edge Sensitive */
    EXTPOLER1_LOW_OR_FALLING = (0UL<<1),  /* Low-Level  or Falling Edge Sensitive */
    EXTPOLER1_HIGH_OR_RISING = (1UL<<1),  /* High-Level or Rising  Edge Sensitive */
    EXTPOLER2_LOW_OR_FALLING = (0UL<<2),  /* Low-Level  or Falling Edge Sensitive */
    EXTPOLER2_HIGH_OR_RISING = (1UL<<2),  /* High-Level or Rising  Edge Sensitive */
    EXTPOLER3_LOW_OR_FALLING = (0UL<<3),  /* Low-Level  or Falling Edge Sensitive */
    EXTPOLER3_HIGH_OR_RISING = (1UL<<3),  /* High-Level or Rising  Edge Sensitive */
} EXTPOLER_t;
#define EXTPOLER_ALL_bm	0x0F
#define EXTPOLER0_bm	(1UL<<0)
#define EXTPOLER1_bm	(1UL<<1)
#define EXTPOLER2_bm	(1UL<<2)
#define EXTPOLER3_bm	(1UL<<3)


/* Register Definition of AHB Configuration */
/*
typedef enum AHBCFG1_enum
{
} AHBCFG1_t;

typedef enum AHBCFG2_enum
{
} AHBCFG2_t;
*/


/* Register Definition of System Controls and Status register */
typedef enum SCS_enum
{
    SCS_GPIOM_GPIO01_LEGACY  = (0UL<<0),  /* GPIO0,1 Set to Classic LPC2000 Style (via APB2) */
    SCS_GPIOM_GPIO01_FAST    = (1UL<<0),  /* GPIO0,1 Set to via addresses in the on-chip memory range. */
    SCS_EMC_RESET_ENABLE 	 = (0UL<<1),  /* EMC Reset Enable */
    SCS_EMC_RESET_DISABLE 	 = (1UL<<1),  /* EMC Reset Disble */
    SCS_EMC_BURST_ENABLE 	 = (0UL<<2),  /* EMC Burst Control Enable */
    SCS_EMC_BURST_DISABLE 	 = (1UL<<2),  /* EMC Burst Control Disble */
	SCS_MCIPWR_PIN_LOW		 = (0UL<<3),  /* MCI Power Pin Low  */
	SCS_MCIPWR_PIN_HIGH		 = (1UL<<3),  /* MCI Power Pin High */
	SCS_OSCRANGE_1_TO_20MHZ  = (0UL<<4),  /* Main oscillator range select. */
	SCS_OSCRANGE_15_TO_24MHZ = (1UL<<4),  /* Main oscillator range select. */
	SCS_OSCEN_DISBLE         = (0UL<<5),  /* Main oscillator Disable. */
	SCS_OSCEN_ENABLE         = (1UL<<5),  /* Main oscillator Enable.  */
	SCS_OSCSTAT_NOTREADY	 = (0UL<<6),  /* Main oscillator is NOT Ready.    */
	SCS_OSCSTAT_READY	     = (1UL<<6),  /* Main oscillator is Ready to use. */
} SCS_t;
#define SCS_GPIOM_GPIO01_bm (1UL<<0)
#define SCS_EMC_RESET_bm	(1UL<<1)
#define SCS_EMC_BURST_bm	(1UL<<2)
#define SCS_EMC_MCIPWR_bm	(1UL<<3)
#define SCS_OSCRANGE_bm		(1UL<<4)
#define SCS_OSCEN_bm		(1UL<<5)
#define SCS_OSCSTAT_bm		(1UL<<6)
/*~~~ret al~~~*/

/* Register Definition of Clock Source Select register */
typedef enum CLKSRCSEL_enum
{
    CLKSRCSEL_INTERNAL_RC = (0UL),  /* Selects the Internal RC oscillator as the PLL clock source. */
    CLKSRCSEL_EXT_MAINOSC = (1UL),  /* Selects the main oscillator as the PLL clock source. */
    CLKSRCSEL_EXT_RTC 	  = (2UL),  /* Selects the RTC oscillator as the PLL clock source. */
} CLKSRCSEL_t;
#define CLKSRCSEL_bm (3UL<<0)


/* Register Definition of PLL Control register */
typedef enum PLLCON_enum
{
    PLLCON_PLLE = (1UL<<0),  /* PLL Enable. */
    PLLCON_PLLC = (1UL<<1),  /* PLL Connect. */
} PLLCON_t;
#define PLLCON_bm 					(3UL<<0)
#define PLLMODE_OFF 				(0UL)
#define PLLMODE_ACTIVE_NOCONNECT	(1UL)
#define PLLMODE_ACTIVE_CONNECT		(3UL)


/* Register Definition of PLL Control register */
#define PLLCFG_MSEL_bm (0x00007FFFUL<<0)
#define PLLCFG_NSEL_bm (0x000000FFUL<<16)


