yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
/* Register Definition of PLL Status register */
#define PLLSTAT_MSEL_bm  		(0x00007FFFUL<<0)
#define PLLSTAT_NSEL_bm  		(0x000000FFUL<<16)
#define PLLSTAT_PLLE_bm  		(1UL<<24)
#define PLLSTAT_PLLC_bm  		(1UL<<25)
#define PLLSTAT_PLOCK_bm 		(1UL<<26)
#define PLLSTAT_CONNECTED		(1UL<<25)
#define PLLSTAT_LOCKED			(1UL<<26)
#define PLLSTAT_ACTIVE_CONNECT 	(3UL<<24)
#define PLLSTAT_OFF	 			(0UL<<24)


/* Register Definition of CPU Clock Configuration register */
#define CCLKCFG_CCLKSEL_bm		(0xFF)


/* Register Definition of USB Clock Configuration register */
#define USBCLKCFG_USBSEL_bm		(0x0F)


/* Register Definition of UIRC Trim Register */
/* This register is used to trim the on-chip 4 MHz oscillator. */
#define IRCTRIM_bm				(0x00FF)


/* Register Definition of Peripheral Clock Selection registers */
typedef enum PCLKDIV_enum
{
	PCLKDIV_4 = (0UL),
	PCLKDIV_1 = (1UL),
	PCLKDIV_2 = (2UL),
	PCLKDIV_8 = (3UL),
	PCLKDIV_6 = (3UL),
} PCLKDIV_t;
#define PCLKSEL_DIV_1_ALL	(0x55555555UL)
#define PCLKSEL_DIV_2_ALL	(0xAAAAAAAAUL)
#define PCLKSEL_DIV_4_ALL	(0x00000000UL)
#define PCLKSEL_DIV_8_ALL	(0xFFFFFFFFUL)

typedef enum PCLKSEL0_enum
{
	PCLKSEL0_WDT_DIV_1 		= (PCLKDIV_1<<0),
	PCLKSEL0_WDT_DIV_2 		= (PCLKDIV_2<<0),
	PCLKSEL0_WDT_DIV_4 		= (PCLKDIV_4<<0),
	PCLKSEL0_WDT_DIV_8 		= (PCLKDIV_8<<0),
	PCLKSEL0_TIMER0_DIV_1	= (PCLKDIV_1<<2),
	PCLKSEL0_TIMER0_DIV_2	= (PCLKDIV_2<<2),
	PCLKSEL0_TIMER0_DIV_4 	= (PCLKDIV_4<<2),
	PCLKSEL0_TIMER0_DIV_8 	= (PCLKDIV_8<<2),
	PCLKSEL0_TIMER1_DIV_1	= (PCLKDIV_1<<4),
	PCLKSEL0_TIMER1_DIV_2	= (PCLKDIV_2<<4),
	PCLKSEL0_TIMER1_DIV_4 	= (PCLKDIV_4<<4),
	PCLKSEL0_TIMER1_DIV_8 	= (PCLKDIV_8<<4),
	PCLKSEL0_UART0_DIV_1	= (PCLKDIV_1<<6),
	PCLKSEL0_UART0_DIV_2	= (PCLKDIV_2<<6),
	PCLKSEL0_UART0_DIV_4 	= (PCLKDIV_4<<6),
	PCLKSEL0_UART0_DIV_8 	= (PCLKDIV_8<<6),
	PCLKSEL0_UART1_DIV_1	= (PCLKDIV_1<<8),
	PCLKSEL0_UART1_DIV_2	= (PCLKDIV_2<<8),
	PCLKSEL0_UART1_DIV_4 	= (PCLKDIV_4<<8),
	PCLKSEL0_UART1_DIV_8 	= (PCLKDIV_8<<8),
	PCLKSEL0_PWM1_DIV_1		= (PCLKDIV_1<<12),
	PCLKSEL0_PWM1_DIV_2		= (PCLKDIV_2<<12),
	PCLKSEL0_PWM1_DIV_4 	= (PCLKDIV_4<<12),
	PCLKSEL0_PWM1_DIV_8 	= (PCLKDIV_8<<12),
	PCLKSEL0_I2C0_DIV_1		= (PCLKDIV_1<<14),
	PCLKSEL0_I2C0_DIV_2		= (PCLKDIV_2<<14),
	PCLKSEL0_I2C0_DIV_4 	= (PCLKDIV_4<<14),
	PCLKSEL0_I2C0_DIV_8 	= (PCLKDIV_8<<14),
	PCLKSEL0_SPI_DIV_1		= (PCLKDIV_1<<16),
	PCLKSEL0_SPI_DIV_2		= (PCLKDIV_2<<16),
	PCLKSEL0_SPI_DIV_4 		= (PCLKDIV_4<<16),
	PCLKSEL0_SPI_DIV_8 		= (PCLKDIV_8<<16),
/*	PCLKSEL0_RTC_DIV_1		= (PCLKDIV_1<<18), *//*"01(DIV1)is illegal for RTC" */
	PCLKSEL0_RTC_DIV_2		= (PCLKDIV_2<<18),
	PCLKSEL0_RTC_DIV_4 		= (PCLKDIV_4<<18),
	PCLKSEL0_RTC_DIV_8 		= (PCLKDIV_8<<18),
	PCLKSEL0_SSP1_DIV_1		= (PCLKDIV_1<<20),
	PCLKSEL0_SSP1_DIV_2		= (PCLKDIV_2<<20),
	PCLKSEL0_SSP1_DIV_4 	= (PCLKDIV_4<<20),
	PCLKSEL0_SSP1_DIV_8 	= (PCLKDIV_8<<20),
	PCLKSEL0_DAC_DIV_1		= (PCLKDIV_1<<22),
	PCLKSEL0_DAC_DIV_2		= (PCLKDIV_2<<22),
	PCLKSEL0_DAC_DIV_4 		= (PCLKDIV_4<<22),
	PCLKSEL0_DAC_DIV_8 		= (PCLKDIV_8<<22),
	PCLKSEL0_ADC_DIV_1		= (PCLKDIV_1<<24),
	PCLKSEL0_ADC_DIV_2		= (PCLKDIV_2<<24),
	PCLKSEL0_ADC_DIV_4 		= (PCLKDIV_4<<24),
	PCLKSEL0_ADC_DIV_8 		= (PCLKDIV_8<<24),
 /* PCLK_CAN1/2 must be set to the same value as PCLK_ACF. */
	PCLKSEL0_CAN1_DIV_1		= (PCLKDIV_1<<26),
	PCLKSEL0_CAN1_DIV_2		= (PCLKDIV_2<<26),
	PCLKSEL0_CAN1_DIV_4 	= (PCLKDIV_4<<26),
	PCLKSEL0_CAN1_DIV_6 	= (PCLKDIV_6<<26), /* "11" = DIV6 on CAN /CANFILTER */
 /* PCLK_CAN1/2 must be set to the same value as PCLK_ACF. */
	PCLKSEL0_CAN2_DIV_1		= (PCLKDIV_1<<28),
	PCLKSEL0_CAN2_DIV_2		= (PCLKDIV_2<<28),
	PCLKSEL0_CAN2_DIV_4 	= (PCLKDIV_4<<28),
	PCLKSEL0_CAN2_DIV_6		= (PCLKDIV_6<<28), /* "11" = DIV6 on CAN /CANFILTER */
 /* PCLK_CAN1/2 must be set to the same value as PCLK_ACF. */
	PCLKSEL0_ACF_DIV_1		= (PCLKDIV_1<<30),
	PCLKSEL0_ACF_DIV_2		= (PCLKDIV_2<<30),
	PCLKSEL0_ACF_DIV_4 		= (PCLKDIV_4<<30),
	PCLKSEL0_ACF_DIV_6		= (PCLKDIV_6<<30), /* "11" = DIV6 on CAN /CANFILTER */
} PCLKSEL0_t;

typedef enum PCLKSEL1_enum
{
	PCLKSEL1_BAT_RAM_DIV_1 	= (PCLKDIV_1<<0),
	PCLKSEL1_BAT_RAM_DIV_2 	= (PCLKDIV_2<<0),
	PCLKSEL1_BAT_RAM_DIV_4 	= (PCLKDIV_4<<0),
	PCLKSEL1_BAT_RAM_DIV_8 	= (PCLKDIV_8<<0),
	PCLKSEL1_GPIO_DIV_1 	= (PCLKDIV_1<<2),
	PCLKSEL1_GPIO_DIV_2 	= (PCLKDIV_2<<2),
	PCLKSEL1_GPIO_DIV_4 	= (PCLKDIV_4<<2),
	PCLKSEL1_GPIO_DIV_8 	= (PCLKDIV_8<<2),
	PCLKSEL1_PCB_DIV_1 		= (PCLKDIV_1<<4),
	PCLKSEL1_PCB_DIV_2 		= (PCLKDIV_2<<4),
	PCLKSEL1_PCB_DIV_4 		= (PCLKDIV_4<<4),
	PCLKSEL1_PCB_DIV_8 		= (PCLKDIV_8<<4),
	PCLKSEL1_I2C1_DIV_1 	= (PCLKDIV_1<<6),
	PCLKSEL1_I2C1_DIV_2 	= (PCLKDIV_2<<6),
	PCLKSEL1_I2C1_DIV_4 	= (PCLKDIV_4<<6),
	PCLKSEL1_I2C1_DIV_8 	= (PCLKDIV_8<<6),
	PCLKSEL1_SSP0_DIV_1 	= (PCLKDIV_1<<10),
	PCLKSEL1_SSP0_DIV_2 	= (PCLKDIV_2<<10),
	PCLKSEL1_SSP0_DIV_4 	= (PCLKDIV_4<<10),
	PCLKSEL1_SSP0_DIV_8 	= (PCLKDIV_8<<10),
	PCLKSEL1_TIMER2_DIV_1 	= (PCLKDIV_1<<12),
	PCLKSEL1_TIMER2_DIV_2 	= (PCLKDIV_2<<12),
	PCLKSEL1_TIMER2_DIV_4 	= (PCLKDIV_4<<12),
	PCLKSEL1_TIMER2_DIV_8	= (PCLKDIV_8<<12),
	PCLKSEL1_TIMER3_DIV_1 	= (PCLKDIV_1<<14),
	PCLKSEL1_TIMER3_DIV_2 	= (PCLKDIV_2<<14),
	PCLKSEL1_TIMER3_DIV_4 	= (PCLKDIV_4<<14),
	PCLKSEL1_TIMER3_DIV_8	= (PCLKDIV_8<<14),
	PCLKSEL1_UART2_DIV_1 	= (PCLKDIV_1<<16),
	PCLKSEL1_UART2_DIV_2 	= (PCLKDIV_2<<16),
	PCLKSEL1_UART2_DIV_4 	= (PCLKDIV_4<<16),
	PCLKSEL1_UART2_DIV_8	= (PCLKDIV_8<<16),
	PCLKSEL1_UART3_DIV_1 	= (PCLKDIV_1<<18),
	PCLKSEL1_UART3_DIV_2 	= (PCLKDIV_2<<18),
	PCLKSEL1_UART3_DIV_4 	= (PCLKDIV_4<<18),
	PCLKSEL1_UART3_DIV_8	= (PCLKDIV_8<<18),
	PCLKSEL1_I2C2_DIV_1 	= (PCLKDIV_1<<20),
	PCLKSEL1_I2C2_DIV_2 	= (PCLKDIV_2<<20),
	PCLKSEL1_I2C2_DIV_4 	= (PCLKDIV_4<<20),
	PCLKSEL1_I2C2_DIV_8		= (PCLKDIV_8<<20),
	PCLKSEL1_I2S_DIV_1 		= (PCLKDIV_1<<22),
	PCLKSEL1_I2S_DIV_2 		= (PCLKDIV_2<<22),
	PCLKSEL1_I2S_DIV_4 		= (PCLKDIV_4<<22),
	PCLKSEL1_I2S_DIV_8		= (PCLKDIV_8<<22),
	PCLKSEL1_MCI_DIV_1 		= (PCLKDIV_1<<24),
	PCLKSEL1_MCI_DIV_2 		= (PCLKDIV_2<<24),
	PCLKSEL1_MCI_DIV_4 		= (PCLKDIV_4<<24),
	PCLKSEL1_MCI_DIV_8		= (PCLKDIV_8<<24),
	PCLKSEL1_SYSCON_DIV_1 	= (PCLKDIV_1<<28),
	PCLKSEL1_SYSCON_DIV_2 	= (PCLKDIV_2<<28),
	PCLKSEL1_SYSCON_DIV_4 	= (PCLKDIV_4<<28),
	PCLKSEL1_SYSCON_DIV_8	= (PCLKDIV_8<<28),
} PCLKSEL1_t;
#define PCLKSEL1_MCI_DIV_bm (PCLKDIV_8<<24)

/* Register Definition of Power Mode Control register */
typedef enum PCON_enum
{
	PCON_PM0 	= (1UL<<0),
	PCON_PM1 	= (1UL<<1),
	PCON_BODPDM = (1UL<<2),
	PCON_BOGD 	= (1UL<<3),
	PCON_BORD 	= (1UL<<4),
	PCON_PM2 	= (1UL<<7),
} PCON_t;
