yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
#define PCON_PMX_bm				(PCON_PM0|PCON_PM1|PCON_PM2)
#define PCON_NOMAL_MODE			(0)
#define PCON_IDOL_MODE  		(PCON_PM0)
#define PCON_SLEEP_MODE  		(PCON_PM0|PCON_PM2)
#define PCON_POWERDOWN_MODE  	(PCON_PM1)
#define PCON_DEEPPOWERDOWN_MODE	(PCON_PM1|PCON_PM2)


/* Register Definition of Interrupt Wakeup Register */
typedef enum INTWAKE_enum
{
	INTWAKE_EXTWAKE0 	= (1UL<<0),
	INTWAKE_EXTWAKE1 	= (1UL<<1),
	INTWAKE_EXTWAKE2 	= (1UL<<2),
	INTWAKE_EXTWAKE3 	= (1UL<<3),
	INTWAKE_EXTWAKE 	= (1UL<<4),
	INTWAKE_USBWAKE 	= (1UL<<5),
	INTWAKE_CANWAKE 	= (1UL<<6),
	INTWAKE_GPIO0WAKE 	= (1UL<<7),
	INTWAKE_GPIO2WAKE 	= (1UL<<8),
	INTWAKE_BODWAKE 	= (1UL<<14),
	INTWAKE_RTCWAKE 	= (1UL<<15),
} INTWAKE_t;
#define INTWAKE_bm		(0xFFFF)


/* Register Definition of Power Control for Peripherals register */
typedef enum PCOMP_enum
{
	PCTIM0 	= (1UL<<1),
	PCTIM1 	= (1UL<<2),
	PCUART0 = (1UL<<3),
	PCUART1 = (1UL<<4),
	PCPWM1 	= (1UL<<6),
	PCI2C0 	= (1UL<<7),
	PCSPI 	= (1UL<<8),
	PCRTC 	= (1UL<<9),
	PCSSP1 	= (1UL<<10),
	PCEMC 	= (1UL<<11),
	PCAD 	= (1UL<<12),
	PCCAN1 	= (1UL<<13),
	PCCAN2 	= (1UL<<14),
	PCI2C1 	= (1UL<<19),
	PCSSP0 	= (1UL<<21),
	PCTIM2 	= (1UL<<22),
	PCTIM3 	= (1UL<<23),
	PCUART2 = (1UL<<24),
	PCUART3 = (1UL<<25),
	PCI2C2 	= (1UL<<26),
	PCI2S 	= (1UL<<27),
	PCSDC	= (1UL<<28),
	PCGPDMA = (1UL<<29),
	PCENET 	= (1UL<<30),
	PCUSB 	= (1UL<<31),
} PCOMP_t;


/* Register Definition of EMC Control Register */
/*
typedef enum EMCControl_enum
{
} EMCControl_t;
*/


/* Register Definition of VIC IRQ Status Register */
/* Register Definition of VIC FIQ Status Register */
/* Register Definition of VIC Raw Interrupt Status Register */
/* Register Definition of VIC Interrupt Enable Register */
/* Register Definition of VIC Interrupt Enable Clear Register */
#define INT_DWT			(0)
#define INT_ARMCORE_RX	(2)
#define INT_ARMCORE_TX  (3)
#define INT_TIMER0		(4)
#define INT_TIMER1		(5)
#define INT_UART0		(6)
#define INT_UART1		(7)
#define INT_PWM1		(8)
#define INT_I2C0		(9)
#define INT_SPI			(10)	/* SPI & SSP0 have same IRQ Number */
#define INT_SSP0		(10) 	/* SPI & SSP0 have same IRQ Number */
#define INT_SSP1		(11)
#define INT_PLL			(12)
#define INT_RTC			(13)
#define INT_EINT0		(14)
#define INT_EINT1		(15)
#define INT_EINT2		(16)
#define INT_EINT3		(17)
#define INT_AD0			(18)
#define INT_I2C1		(19)
#define INT_BOD			(20)
#define INT_ETHERNET	(21)
#define INT_USB			(22)
#define INT_CAN_1_2		(23)
#define INT_MCI			(24)
#define INT_GPDMA		(25)
#define INT_TIMER2		(26)
#define INT_TIMER3		(27)
#define INT_UART2		(28)
#define INT_UART3		(29)
#define INT_I2C2		(30)
#define INT_I2S			(31)

/* Register Definition of VIC Interrupt Select register */
#define INT_IRQ			(0)
#define INT_FIQ			(1)

/* Register Definition of VIC Vector Priority Registers x */
#define VICVPx_HIGHEST  (0x00)
#define VICVPx_LOWEST   (0x0F)

/* Register Definition of VIC Software Priority Mask Register */
#define VICSWPriorityMask_bm	(0x0000FFFF)


/* Register Definition of Protection Enable Register */
typedef enum VICProtection_enum
{
	VIC_ACCESS_NOT_PROTECTED = (0UL<<0), /* VIC registers can be accessed in User or privileged mode. */
	VIC_ACCESS_PROTECTED 	 = (1UL<<0), /* VIC registers can only be accessed in privileged mode. */
} VICProtection_t;


/* Register Definition of MAM Control Register */
typedef enum MAMCR_enum
{
	MAMCR_DISABLE 		 = (0),
	MAMCR_PARTIAL_ENABLE = (1),
	MAMCR_FULL_ENABLE 	 = (2),
} MAMCR_t;
#define MAMCR_bm		(0x03)

/* Register Definition of MAM Timing Register */
typedef enum MAMTIM_enum
{
	MAMTIM_0_TO_20MHZ  = (1),
	MAMTIM_20_TO_40MHZ = (2),
	MAMTIM_40_TO_60MHZ = (3),
	MAMTIM_60_TO_72MHZ = (4),
} MAMTIM_t;
#define MAMTIM_bm		(0x07)


/* Register Definition of Pin Function Select register 0 */
typedef enum PINSEL0_enum
{
	PINSEL0_P0_0_GPIO0_0  		= (0UL<<0),
	PINSEL0_P0_0_RD1   			= (1UL<<0),
	PINSEL0_P0_0_TXD3  			= (2UL<<0),
	PINSEL0_P0_0_SDA1  			= (3UL<<0),
	PINSEL0_P0_1_GPIO0_1  		= (0UL<<2),
	PINSEL0_P0_1_TD1   			= (1UL<<2),
	PINSEL0_P0_1_RXD3  			= (2UL<<2),
	PINSEL0_P0_1_SCL1  			= (3UL<<2),
	PINSEL0_P0_2_GPIO0_2		= (0UL<<4),
	PINSEL0_P0_2_TXD0  			= (1UL<<4),
	PINSEL0_P0_3_GPIO0_3  		= (0UL<<6),
	PINSEL0_P0_3_RXD0  			= (1UL<<6),
	PINSEL0_P0_4_GPIO0_4		= (0UL<<8),
	PINSEL0_P0_4_I2SRX_CLK   	= (1UL<<8),
	PINSEL0_P0_4_RD2  			= (2UL<<8),
	PINSEL0_P0_4_CAP2_0  		= (3UL<<8),
	PINSEL0_P0_5_GPIO0_5		= (0UL<<10),
	PINSEL0_P0_5_I2SRX_WS   	= (1UL<<10),
	PINSEL0_P0_5_TD2  			= (2UL<<10),
	PINSEL0_P0_5_CAP2_1  		= (3UL<<10),
	PINSEL0_P0_6_GPIO0_6		= (0UL<<12),
	PINSEL0_P0_6_I2SRX_SDA   	= (1UL<<12),
	PINSEL0_P0_6_SSEL1 			= (2UL<<12),
	PINSEL0_P0_6_MAT2_0  		= (3UL<<12),
	PINSEL0_P0_7_GPIO0_7		= (0UL<<14),
	PINSEL0_P0_7_I2STX_CLK   	= (1UL<<14),
	PINSEL0_P0_7_SCK1 			= (2UL<<14),
	PINSEL0_P0_7_MAT2_1  		= (3UL<<14),
	PINSEL0_P0_8_GPIO0_8		= (0UL<<16),
	PINSEL0_P0_8_I2STX_WS   	= (1UL<<16),
	PINSEL0_P0_8_MISO1 			= (2UL<<16),
	PINSEL0_P0_8_MAT2_2  		= (3UL<<16),
	PINSEL0_P0_9_GPIO0_9		= (0UL<<18),
	PINSEL0_P0_9_I2STX_SDA   	= (1UL<<18),
	PINSEL0_P0_9_MOSI1 			= (2UL<<18),
	PINSEL0_P0_9_MAT2_4  		= (3UL<<18),
	PINSEL0_P0_10_GPIO0_10		= (0UL<<20),
	PINSEL0_P0_10_TXD2		   	= (1UL<<20),
	PINSEL0_P0_10_SDA2 			= (2UL<<20),
	PINSEL0_P0_10_MAT3_0  		= (3UL<<20),
	PINSEL0_P0_11_GPIO0_11		= (0UL<<22),
	PINSEL0_P0_11_RXD2		   	= (1UL<<22),
	PINSEL0_P0_11_SCL2 			= (2UL<<22),
	PINSEL0_P0_11_MAT3_1  		= (3UL<<22),
	PINSEL0_P0_12_GPIO0_12		= (0UL<<24),
	PINSEL0_P0_12_USB_PPWR2		= (1UL<<24),
	PINSEL0_P0_12_MISO1 		= (2UL<<24),
	PINSEL0_P0_12_AD0_6  		= (3UL<<24),
	PINSEL0_P0_13_GPIO0_13		= (0UL<<26),
	PINSEL0_P0_13_USB_UP_LED2	= (1UL<<26),
	PINSEL0_P0_13_MOSI1 		= (2UL<<26),
	PINSEL0_P0_13_AD0_7  		= (3UL<<26),
	PINSEL0_P0_14_GPIO0_14		= (0UL<<28),
	PINSEL0_P0_14_USB_HSTEN2	= (1UL<<28),
	PINSEL0_P0_14_USB_CONNECT2 	= (2UL<<28),
	PINSEL0_P0_14_SSEL1  		= (3UL<<28),
	PINSEL0_P0_15_GPIO0_15		= (0UL<<30),
	PINSEL0_P0_15_TXD1			= (1UL<<30),
	PINSEL0_P0_15_SCK0		 	= (2UL<<30),
	PINSEL0_P0_15_SCK	  		= (3UL<<30),
} PINSEL0_t;
#define PINSEL0_ALL_bm		(0xFFFFFFFF)
#define PINSEL0_P0_0_bm		(3UL<<0)
#define PINSEL0_P0_1_bm		(3UL<<2)
#define PINSEL0_P0_2_bm		(3UL<<4)
#define PINSEL0_P0_3_bm		(3UL<<6)
#define PINSEL0_P0_4_bm		(3UL<<8)
#define PINSEL0_P0_5_bm		(3UL<<10)
#define PINSEL0_P0_6_bm		(3UL<<12)
#define PINSEL0_P0_7_bm		(3UL<<14)
#define PINSEL0_P0_8_bm		(3UL<<16)
#define PINSEL0_P0_9_bm		(3UL<<18)
#define PINSEL0_P0_10_bm	(3UL<<20)
#define PINSEL0_P0_11_bm	(3UL<<22)
#define PINSEL0_P0_12_bm	(3UL<<24)
#define PINSEL0_P0_13_bm	(3UL<<26)
#define PINSEL0_P0_14_bm	(3UL<<28)
#define PINSEL0_P0_15_bm	(3UL<<30)


