yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
/* Register Definition of Pin Function Select register 1 */
typedef enum PINSEL1_enum
{
	PINSEL1_P0_16_GPIO0_16  	= (0UL<<0),
	PINSEL1_P0_16_RXD1   		= (1UL<<0),
	PINSEL1_P0_16_SSEL0  		= (2UL<<0),
	PINSEL1_P0_16_SSEL  		= (3UL<<0),
	PINSEL1_P0_17_GPIO0_17  	= (0UL<<2),
	PINSEL1_P0_17_CTS1   		= (1UL<<2),
	PINSEL1_P0_17_MISO0  		= (2UL<<2),
	PINSEL1_P0_17_MISO  		= (3UL<<2),
	PINSEL1_P0_18_GPIO0_18  	= (0UL<<4),
	PINSEL1_P0_18_DCD1   		= (1UL<<4),
	PINSEL1_P0_18_MOSI0  		= (2UL<<4),
	PINSEL1_P0_18_MOSI  		= (3UL<<4),
	PINSEL1_P0_19_GPIO0_19  	= (0UL<<6),
	PINSEL1_P0_19_DSR11   		= (1UL<<6),
	PINSEL1_P0_19_MCICLK  		= (2UL<<6),
	PINSEL1_P0_19_SDA1  		= (3UL<<6),
	PINSEL1_P0_20_GPIO0_20		= (0UL<<8),
	PINSEL1_P0_20_DTR1		   	= (1UL<<8),
	PINSEL1_P0_20_MCICMD  		= (2UL<<8),
	PINSEL1_P0_20_SCL1  		= (3UL<<8),
	PINSEL1_P0_21_GPIO0_21		= (0UL<<10),
	PINSEL1_P0_21_RI1  		 	= (1UL<<10),
	PINSEL1_P0_21_MCIPWR  		= (2UL<<10),
	PINSEL1_P0_21_RD1	  		= (3UL<<10),
	PINSEL1_P0_22_GPIO0_22		= (0UL<<12),
	PINSEL1_P0_22_RTS1		   	= (1UL<<12),
	PINSEL1_P0_22_MCIDAT0 		= (2UL<<12),
	PINSEL1_P0_22_TD1	  		= (3UL<<12),
	PINSEL1_P0_23_GPIO0_23		= (0UL<<14),
	PINSEL1_P0_23_AD0_0		   	= (1UL<<14),
	PINSEL1_P0_23_I2SRX_CLK 	= (2UL<<14),
	PINSEL1_P0_23_CAP3_0  		= (3UL<<14),
	PINSEL1_P0_24_GPIO0_24		= (0UL<<16),
	PINSEL1_P0_24_AD0_1		   	= (1UL<<16),
	PINSEL1_P0_24_I2SRX_WS 		= (2UL<<16),
	PINSEL1_P0_24_CAP3_1  		= (3UL<<16),
	PINSEL1_P0_25_GPIO0_25		= (0UL<<18),
	PINSEL1_P0_25_AD0_2		   	= (1UL<<18),
	PINSEL1_P0_25_I2SRX_SDA 	= (2UL<<18),
	PINSEL1_P0_25_TXD3  		= (3UL<<18),
	PINSEL1_P0_26_GPIO0_26		= (0UL<<20),
	PINSEL1_P0_26_AD0_3		   	= (1UL<<20),
	PINSEL1_P0_26_AOUT 			= (2UL<<20),
	PINSEL1_P0_26_RXD3  		= (3UL<<20),
	PINSEL1_P0_27_GPIO0_27		= (0UL<<22),
	PINSEL1_P0_27_SDA0		   	= (1UL<<22),
	PINSEL1_P0_28_GPIO0_28		= (0UL<<24),
	PINSEL1_P0_28_SCL0			= (1UL<<24),
	PINSEL1_P0_29_GPIO0_29		= (0UL<<26),
	PINSEL1_P0_29_USB_DP1		= (1UL<<26),
	PINSEL1_P0_30_GPIO0_30		= (0UL<<28),
	PINSEL1_P0_30_USB_DM1		= (1UL<<28),
	PINSEL1_P0_31_GPIO0_31		= (0UL<<30),
	PINSEL1_P0_31_USB_DP2		= (1UL<<30),
} PINSEL1_t;
#define PINSEL1_ALL_bm		(0xFFFFFFFF)
#define PINSEL1_P0_16_bm	(3UL<<0)
#define PINSEL1_P0_17_bm	(3UL<<2)
#define PINSEL1_P0_18_bm	(3UL<<4)
#define PINSEL1_P0_19_bm	(3UL<<6)
#define PINSEL1_P0_20_bm	(3UL<<8)
#define PINSEL1_P0_21_bm	(3UL<<10)
#define PINSEL1_P0_22_bm	(3UL<<12)
#define PINSEL1_P0_23_bm	(3UL<<14)
#define PINSEL1_P0_24_bm	(3UL<<16)
#define PINSEL1_P0_25_bm	(3UL<<18)
#define PINSEL1_P0_26_bm	(3UL<<20)
#define PINSEL1_P0_27_bm	(3UL<<22)
#define PINSEL1_P0_28_bm	(3UL<<24)
#define PINSEL1_P0_29_bm	(3UL<<26)
#define PINSEL1_P0_30_bm	(3UL<<28)
#define PINSEL1_P0_31_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 2 */
typedef enum PINSEL2_enum
{
	PINSEL2_P1_0_GPIO1_0  		= (0UL<<0),
	PINSEL2_P1_0_ENET_TXD0   	= (1UL<<0),
	PINSEL2_P1_1_GPIO1_1  		= (0UL<<2),
	PINSEL2_P1_1_ENET_TXD1  	= (1UL<<2),
	PINSEL2_P1_4_GPIO1_4		= (0UL<<8),
	PINSEL2_P1_4_ENET_TX_EN   	= (1UL<<8),
	PINSEL2_P1_8_GPIO1_8		= (0UL<<16),
	PINSEL2_P1_8_ENET_CRS   	= (1UL<<16),
	PINSEL2_P1_9_GPIO1_9		= (0UL<<18),
	PINSEL2_P1_9_ENET_RXD0   	= (1UL<<18),
	PINSEL2_P1_10_GPIO1_10		= (0UL<<20),
	PINSEL2_P1_10_ENET_RXD1		= (1UL<<20),
	PINSEL2_P1_14_GPIO1_14		= (0UL<<28),
	PINSEL2_P1_14_ENET_RX_ER	= (1UL<<28),
	PINSEL2_P1_15_GPIO1_15		= (0UL<<30),
	PINSEL2_P1_15_ENET_REF_CLK	= (1UL<<30),
} PINSEL2_t;
#define PINSEL2_ALL_bm		(0xFFFFFFFF)
#define PINSEL2_P1_0_bm		(3UL<<0)
#define PINSEL2_P1_1_bm		(3UL<<2)
#define PINSEL2_P1_2_bm		(3UL<<4)
#define PINSEL2_P1_3_bm		(3UL<<6)
#define PINSEL2_P1_4_bm		(3UL<<8)
#define PINSEL2_P1_5_bm		(3UL<<10)
#define PINSEL2_P1_6_bm		(3UL<<12)
#define PINSEL2_P1_7_bm		(3UL<<14)
#define PINSEL2_P1_8_bm		(3UL<<16)
#define PINSEL2_P1_9_bm		(3UL<<18)
#define PINSEL2_P1_10_bm	(3UL<<20)
#define PINSEL2_P1_11_bm	(3UL<<22)
#define PINSEL2_P1_12_bm	(3UL<<24)
#define PINSEL2_P1_13_bm	(3UL<<26)
#define PINSEL2_P1_14_bm	(3UL<<28)
#define PINSEL2_P1_15_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 3 */
typedef enum PINSEL3_enum
{
	PINSEL3_P1_16_GPIO1_16  	= (0UL<<0),
	PINSEL3_P1_16_MDC   		= (1UL<<0),
	PINSEL3_P1_17_GPIO1_17  	= (0UL<<2),
	PINSEL3_P1_17_MDIO   		= (1UL<<2),
	PINSEL3_P1_18_GPIO1_18  	= (0UL<<4),
	PINSEL3_P1_18_USB_UP_LED   	= (1UL<<4),
	PINSEL3_P1_18_PWM1_1  		= (2UL<<4),
	PINSEL3_P1_18_CAP1_0  		= (3UL<<4),
	PINSEL3_P1_19_GPIO1_19  	= (0UL<<6),
	PINSEL3_P1_19_USB_TX_E1   	= (1UL<<6),
	PINSEL3_P1_19_USP_PPWR1  	= (2UL<<6),
	PINSEL3_P1_19_CAP1_1  		= (3UL<<6),
	PINSEL3_P1_20_GPIO1_20		= (0UL<<8),
	PINSEL3_P1_20_USB_TX_DP1	= (1UL<<8),
	PINSEL3_P1_20_PWM1_2 		= (2UL<<8),
	PINSEL3_P1_20_SCK0  		= (3UL<<8),
	PINSEL3_P1_21_GPIO1_21		= (0UL<<10),
	PINSEL3_P1_21_USB_TX_DM1  	= (1UL<<10),
	PINSEL3_P1_21_PWM1_3  		= (2UL<<10),
	PINSEL3_P1_21_SSEL0	  		= (3UL<<10),
	PINSEL3_P1_22_GPIO1_22		= (0UL<<12),
	PINSEL3_P1_22_USB_RCV1		= (1UL<<12),
	PINSEL3_P1_22_PWRD1 		= (2UL<<12),
	PINSEL3_P1_22_MAT1_0	  	= (3UL<<12),
	PINSEL3_P1_23_GPIO1_23		= (0UL<<14),
	PINSEL3_P1_23_USB_RX_DP1	= (1UL<<14),
	PINSEL3_P1_23_PWM1_4	 	= (2UL<<14),
	PINSEL3_P1_23_MISO0  		= (3UL<<14),
	PINSEL3_P1_24_GPIO1_24		= (0UL<<16),
	PINSEL3_P1_24_USB_RX_DM1	= (1UL<<16),
	PINSEL3_P1_24_PWM1_5 		= (2UL<<16),
	PINSEL3_P1_24_MOSI0 		= (3UL<<16),
	PINSEL3_P1_25_GPIO1_25		= (0UL<<18),
	PINSEL3_P1_25_USB_LS1		= (1UL<<18),
	PINSEL3_P1_25_USB_HSTEN1 	= (2UL<<18),
	PINSEL3_P1_25_MAT1_1  		= (3UL<<18),
	PINSEL3_P1_26_GPIO1_26		= (0UL<<20),
	PINSEL3_P1_26_USB_SSPND1	= (1UL<<20),
	PINSEL3_P1_26_PWM1_6		= (2UL<<20),
	PINSEL3_P1_26_CAP0_0  		= (3UL<<20),
	PINSEL3_P1_27_GPIO1_27		= (0UL<<22),
	PINSEL3_P1_27_USB_INT1		= (1UL<<22),
	PINSEL3_P1_27_USB_OVRCR1	= (2UL<<22),
	PINSEL3_P1_27_CAP0_1		= (3UL<<22),
	PINSEL3_P1_28_GPIO1_28		= (0UL<<24),
	PINSEL3_P1_28_USB_SCL1		= (1UL<<24),
	PINSEL3_P1_28_PCAP1_0		= (2UL<<24),
	PINSEL3_P1_28_MAT0_0		= (3UL<<24),
	PINSEL3_P1_29_GPIO1_29		= (0UL<<26),
	PINSEL3_P1_29_USB_SDA1		= (1UL<<26),
	PINSEL3_P1_29_PCAP1_1		= (2UL<<26),
	PINSEL3_P1_29_MAT0_1		= (3UL<<26),
	PINSEL3_P1_30_GPIO1_30		= (0UL<<28),
	PINSEL3_P1_30_USB_PWRD2		= (1UL<<28),
	PINSEL3_P1_30_VBUS			= (2UL<<28),
	PINSEL3_P1_30_AD0_4			= (3UL<<28),
	PINSEL3_P1_31_GPIO1_31		= (0UL<<30),
	PINSEL3_P1_31_USB_OVRCR2	= (1UL<<30),
	PINSEL3_P1_31_SCK1			= (2UL<<30),
	PINSEL3_P1_31_AD0_5			= (3UL<<30),
} PINSEL3_t;
