yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
#define PINSEL3_ALL_bm		(0xFFFFFFFF)
#define PINSEL3_P1_16_bm	(3UL<<0)
#define PINSEL3_P1_17_bm	(3UL<<2)
#define PINSEL3_P1_18_bm	(3UL<<4)
#define PINSEL3_P1_19_bm	(3UL<<6)
#define PINSEL3_P1_20_bm	(3UL<<8)
#define PINSEL3_P1_21_bm	(3UL<<10)
#define PINSEL3_P1_22_bm	(3UL<<12)
#define PINSEL3_P1_23_bm	(3UL<<14)
#define PINSEL3_P1_24_bm	(3UL<<16)
#define PINSEL3_P1_25_bm	(3UL<<18)
#define PINSEL3_P1_26_bm	(3UL<<20)
#define PINSEL3_P1_27_bm	(3UL<<22)
#define PINSEL3_P1_28_bm	(3UL<<24)
#define PINSEL3_P1_29_bm	(3UL<<26)
#define PINSEL3_P1_30_bm	(3UL<<28)
#define PINSEL3_P1_31_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 4 */
typedef enum PINSEL4_enum
{
	PINSEL4_P2_0_GPIO2_0  		= (0UL<<0),
	PINSEL4_P2_0_PWM1_1   		= (1UL<<0),
	PINSEL4_P2_0_TXD1  			= (2UL<<0),
	PINSEL4_P2_0_TRACECLK  		= (3UL<<0),
	PINSEL4_P2_1_GPIO2_1  		= (0UL<<2),
	PINSEL4_P2_1_PWM1_2   		= (1UL<<2),
	PINSEL4_P2_1_RXD1  			= (2UL<<2),
	PINSEL4_P2_1_PIPESTAT0  	= (3UL<<2),
	PINSEL4_P2_2_GPIO2_2		= (0UL<<4),
	PINSEL4_P2_2_PWM1_3  		= (1UL<<4),
	PINSEL4_P2_2_CTS1  			= (2UL<<4),
	PINSEL4_P2_2_PIPESTAT1  	= (3UL<<4),
	PINSEL4_P2_3_GPIO2_3  		= (0UL<<6),
	PINSEL4_P2_3_PWM1_4  		= (1UL<<6),
	PINSEL4_P2_3_DCD1  			= (2UL<<6),
	PINSEL4_P2_3_PIPESTAT2  	= (3UL<<6),
	PINSEL4_P2_4_GPIO2_4		= (0UL<<8),
	PINSEL4_P2_4_PWM1_5		   	= (1UL<<8),
	PINSEL4_P2_4_DSR1  			= (2UL<<8),
	PINSEL4_P2_4_TRACESYNC  	= (3UL<<8),
	PINSEL4_P2_5_GPIO2_5		= (0UL<<10),
	PINSEL4_P2_5_PWM1_6		   	= (1UL<<10),
	PINSEL4_P2_5_DTR1  			= (2UL<<10),
	PINSEL4_P2_5_TRACEPKT0  	= (3UL<<10),
	PINSEL4_P2_6_GPIO2_6		= (0UL<<12),
	PINSEL4_P2_6_PCAP1_0	   	= (1UL<<12),
	PINSEL4_P2_6_RI1 			= (2UL<<12),
	PINSEL4_P2_6_TRACEPKT1 		= (3UL<<12),
	PINSEL4_P2_7_GPIO2_7		= (0UL<<14),
	PINSEL4_P2_7_RD2		   	= (1UL<<14),
	PINSEL4_P2_7_RTS1 			= (2UL<<14),
	PINSEL4_P2_7_TRACEPKT2  	= (3UL<<14),
	PINSEL4_P2_8_GPIO2_8		= (0UL<<16),
	PINSEL4_P2_8_TD2		   	= (1UL<<16),
	PINSEL4_P2_8_TXD2 			= (2UL<<16),
	PINSEL4_P2_8_TRACEPKT3  	= (3UL<<16),
	PINSEL4_P2_9_GPIO2_9		= (0UL<<18),
	PINSEL4_P2_9_USB_CONNECT1   = (1UL<<18),
	PINSEL4_P2_9_RXD2 			= (2UL<<18),
	PINSEL4_P2_9_EXINT0  		= (3UL<<18),
	PINSEL4_P2_10_GPIO2_10		= (0UL<<20),
	PINSEL4_P2_10_EINT0		   	= (1UL<<20),
	PINSEL4_P2_11_GPIO2_11		= (0UL<<22),
	PINSEL4_P2_11_EINT1		   	= (1UL<<22),
	PINSEL4_P2_11_MCIDAT1 		= (2UL<<22),
	PINSEL4_P2_11_I2STX_CLK  	= (3UL<<22),
	PINSEL4_P2_12_GPIO2_12		= (0UL<<24),
	PINSEL4_P2_12_EINT2			= (1UL<<24),
	PINSEL4_P2_12_MCIDAT2 		= (2UL<<24),
	PINSEL4_P2_12_I2STX_WS  	= (3UL<<24),
	PINSEL4_P2_13_GPIO2_13		= (0UL<<26),
	PINSEL4_P2_13_EINT3			= (1UL<<26),
	PINSEL4_P2_13_MCIDAT3 		= (2UL<<26),
	PINSEL4_P2_13_I2STX_SDA  	= (3UL<<26),
} PINSEL4_t;
#define PINSEL4_ALL_bm		(0xFFFFFFFF)
#define PINSEL4_P2_0_bm		(3UL<<0)
#define PINSEL4_P2_1_bm		(3UL<<2)
#define PINSEL4_P2_2_bm		(3UL<<4)
#define PINSEL4_P2_3_bm		(3UL<<6)
#define PINSEL4_P2_4_bm		(3UL<<8)
#define PINSEL4_P2_5_bm		(3UL<<10)
#define PINSEL4_P2_6_bm		(3UL<<12)
#define PINSEL4_P2_7_bm		(3UL<<14)
#define PINSEL4_P2_8_bm		(3UL<<16)
#define PINSEL4_P2_9_bm		(3UL<<18)
#define PINSEL4_P2_10_bm	(3UL<<20)
#define PINSEL4_P2_11_bm	(3UL<<22)
#define PINSEL4_P2_12_bm	(3UL<<24)
#define PINSEL4_P2_13_bm	(3UL<<26)
#define PINSEL4_P2_14_bm	(3UL<<28)
#define PINSEL4_P2_15_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 5 */
/* LPC23xx has no available pin for PINSEL5 */ 

/* Register Definition of Pin Function Select register 6 */
typedef enum PINSEL6_enum
{
	PINSEL6_P3_0_GPIO3_0  		= (0UL<<0),
	PINSEL6_P3_0_D0   			= (1UL<<0),
	PINSEL6_P3_1_GPIO3_1  		= (0UL<<2),
	PINSEL6_P3_1_D1   			= (1UL<<2),
	PINSEL6_P3_2_GPIO3_2		= (0UL<<4),
	PINSEL6_P3_2_D2  			= (1UL<<4),
	PINSEL6_P3_3_GPIO3_3  		= (0UL<<6),
	PINSEL6_P3_3_D3  			= (1UL<<6),
	PINSEL6_P3_4_GPIO3_4		= (0UL<<8),
	PINSEL6_P3_4_D4			   	= (1UL<<8),
	PINSEL6_P3_5_GPIO3_5		= (0UL<<10),
	PINSEL6_P3_5_D5		   		= (1UL<<10),
	PINSEL6_P3_6_GPIO3_6		= (0UL<<12),
	PINSEL6_P3_6_D6			   	= (1UL<<12),
	PINSEL6_P3_7_GPIO3_7		= (0UL<<14),
	PINSEL6_P3_7_D7			   	= (1UL<<14),
} PINSEL6_t;
#define PINSEL6_ALL_bm		(0xFFFFFFFF)
#define PINSEL6_P3_0_bm		(3UL<<0)
#define PINSEL6_P3_1_bm		(3UL<<2)
#define PINSEL6_P3_2_bm		(3UL<<4)
#define PINSEL6_P3_3_bm		(3UL<<6)
#define PINSEL6_P3_4_bm		(3UL<<8)
#define PINSEL6_P3_5_bm		(3UL<<10)
#define PINSEL6_P3_6_bm		(3UL<<12)
#define PINSEL6_P3_7_bm		(3UL<<14)
#define PINSEL6_P3_8_bm		(3UL<<16)
#define PINSEL6_P3_9_bm		(3UL<<18)
#define PINSEL6_P3_10_bm	(3UL<<20)
#define PINSEL6_P3_11_bm	(3UL<<22)
#define PINSEL6_P3_12_bm	(3UL<<24)
#define PINSEL6_P3_13_bm	(3UL<<26)
#define PINSEL6_P3_14_bm	(3UL<<28)
#define PINSEL6_P3_15_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 7 */
typedef enum PINSEL7_enum
{
	PINSEL7_P3_23_GPIO3_23		= (0UL<<14),
	PINSEL7_P3_23_CAP0_0		= (2UL<<14),
	PINSEL7_P3_23_PCAP1_0  		= (3UL<<14),
	PINSEL7_P3_24_GPIO3_24		= (0UL<<16),
	PINSEL7_P3_24_CAP0_1 		= (2UL<<16),
	PINSEL7_P3_24_PWM1_1  		= (3UL<<16),
	PINSEL7_P3_25_GPIO3_25		= (0UL<<18),
	PINSEL7_P3_25_MAT0_0	 	= (2UL<<18),
	PINSEL7_P3_25_PWM1_2  		= (3UL<<18),
	PINSEL7_P3_26_GPIO3_26		= (0UL<<20),
	PINSEL7_P3_26_MAT0_1 		= (2UL<<20),
	PINSEL7_P3_26_PWM1_3  		= (3UL<<20),
} PINSEL7_t;
#define PINSEL7_ALL_bm		(0xFFFFFFFF)
#define PINSEL7_P3_16_bm	(3UL<<0)
#define PINSEL7_P3_17_bm	(3UL<<2)
#define PINSEL7_P3_18_bm	(3UL<<4)
#define PINSEL7_P3_19_bm	(3UL<<6)
#define PINSEL7_P3_20_bm	(3UL<<8)
#define PINSEL7_P3_21_bm	(3UL<<10)
#define PINSEL7_P3_22_bm	(3UL<<12)
#define PINSEL7_P3_23_bm	(3UL<<14)
#define PINSEL7_P3_24_bm	(3UL<<16)
#define PINSEL7_P3_25_bm	(3UL<<18)
#define PINSEL7_P3_26_bm	(3UL<<20)
#define PINSEL7_P3_27_bm	(3UL<<22)
#define PINSEL7_P3_28_bm	(3UL<<24)
#define PINSEL7_P3_29_bm	(3UL<<26)
#define PINSEL7_P3_30_bm	(3UL<<28)
#define PINSEL7_P3_31_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 8 */
typedef enum PINSEL8_enum
{
	PINSEL8_P4_0_GPIO4_0  		= (0UL<<0),
	PINSEL8_P4_0_A0   			= (1UL<<0),
	PINSEL8_P4_1_GPIO4_1  		= (0UL<<2),
	PINSEL8_P4_1_A1   			= (1UL<<2),
	PINSEL8_P4_2_GPIO4_2		= (0UL<<4),
	PINSEL8_P4_2_A2  			= (1UL<<4),
	PINSEL8_P4_3_GPIO4_3  		= (0UL<<6),
	PINSEL8_P4_3_A3  			= (1UL<<6),
	PINSEL8_P4_4_GPIO4_4		= (0UL<<8),
	PINSEL8_P4_4_A4			   	= (1UL<<8),
	PINSEL8_P4_5_GPIO4_5		= (0UL<<10),
	PINSEL8_P4_5_A5			   	= (1UL<<10),
	PINSEL8_P4_6_GPIO4_6		= (0UL<<12),
	PINSEL8_P4_6_A6			   	= (1UL<<12),
	PINSEL8_P4_7_GPIO4_7		= (0UL<<14),
	PINSEL8_P4_7_A7			   	= (1UL<<14),
	PINSEL8_P4_8_GPIO4_8		= (0UL<<16),
	PINSEL8_P4_8_A8			   	= (1UL<<16),
	PINSEL8_P4_9_GPIO4_9		= (0UL<<18),
	PINSEL8_P4_9_A9			   	= (1UL<<18),
	PINSEL8_P4_10_GPIO4_10		= (0UL<<20),
	PINSEL8_P4_10_A10		   	= (1UL<<20),
	PINSEL8_P4_11_GPIO4_11		= (0UL<<22),
	PINSEL8_P4_11_A11		   	= (1UL<<22),
	PINSEL8_P4_12_GPIO4_12		= (0UL<<24),
	PINSEL8_P4_12_A12			= (1UL<<24),
	PINSEL8_P4_13_GPIO4_13		= (0UL<<26),
	PINSEL8_P4_13_A13			= (1UL<<26),
	PINSEL8_P4_14_GPIO4_14		= (0UL<<28),
	PINSEL8_P4_14_A14			= (1UL<<28),
	PINSEL8_P4_15_GPIO4_15		= (0UL<<30),
	PINSEL8_P4_15_A15			= (1UL<<30),
} PINSEL8_t;
