yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
#define PINSEL8_ALL_bm		(0xFFFFFFFF)
#define PINSEL8_P4_0_bm		(3UL<<0)
#define PINSEL8_P4_1_bm		(3UL<<2)
#define PINSEL8_P4_2_bm		(3UL<<4)
#define PINSEL8_P4_3_bm		(3UL<<6)
#define PINSEL8_P4_4_bm		(3UL<<8)
#define PINSEL8_P4_5_bm		(3UL<<10)
#define PINSEL8_P4_6_bm		(3UL<<12)
#define PINSEL8_P4_7_bm		(3UL<<14)
#define PINSEL8_P4_8_bm		(3UL<<16)
#define PINSEL8_P4_9_bm		(3UL<<18)
#define PINSEL8_P4_10_bm	(3UL<<20)
#define PINSEL8_P4_11_bm	(3UL<<22)
#define PINSEL8_P4_12_bm	(3UL<<24)
#define PINSEL8_P4_13_bm	(3UL<<26)
#define PINSEL8_P4_14_bm	(3UL<<28)
#define PINSEL8_P4_15_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 9 */
typedef enum PINSEL9_enum
{
	PINSEL9_P4_28_GPIO4_28		= (0UL<<24),
	PINSEL9_P4_28_MST2_0		= (2UL<<24),
	PINSEL9_P4_28_TXD3			= (3UL<<24),
	PINSEL9_P4_29_GPIO4_29		= (0UL<<26),
	PINSEL9_P4_29_MAT2_1		= (2UL<<26),
	PINSEL9_P4_28_RXD3			= (3UL<<26),

} PINSEL9_t;
#define PINSEL9_ALL_bm		(0xFFFFFFFF)
#define PINSEL9_P4_16_bm	(3UL<<0)
#define PINSEL9_P4_17_bm	(3UL<<2)
#define PINSEL9_P4_18_bm	(3UL<<4)
#define PINSEL9_P4_19_bm	(3UL<<6)
#define PINSEL9_P4_20_bm	(3UL<<8)
#define PINSEL9_P4_21_bm	(3UL<<10)
#define PINSEL9_P4_22_bm	(3UL<<12)
#define PINSEL9_P4_23_bm	(3UL<<14)
#define PINSEL9_P4_24_bm	(3UL<<16)
#define PINSEL9_P4_25_bm	(3UL<<18)
#define PINSEL9_P4_26_bm	(3UL<<20)
#define PINSEL9_P4_27_bm	(3UL<<22)
#define PINSEL9_P4_28_bm	(3UL<<24)
#define PINSEL9_P4_29_bm	(3UL<<26)
#define PINSEL9_P4_30_bm	(3UL<<28)
#define PINSEL9_P4_31_bm	(3UL<<30)


/* Register Definition of Pin Function Select register 10 */
typedef enum PINSEL10_enum
{
	PINSEL10_ETM_DISABLE		= (0UL<<3),
	PINSEL10_ETM_ENABLE			= (1UL<<3),
} PINSEL10_t;


#define PINSELx_ALL_bm		(0xFFFFFFFF)
#define PINSELx_Px_0_bm		(3UL<<0)
#define PINSELx_Px_1_bm		(3UL<<2)
#define PINSELx_Px_2_bm		(3UL<<4)
#define PINSELx_Px_3_bm		(3UL<<6)
#define PINSELx_Px_4_bm		(3UL<<8)
#define PINSELx_Px_5_bm		(3UL<<10)
#define PINSELx_Px_6_bm		(3UL<<12)
#define PINSELx_Px_7_bm		(3UL<<14)
#define PINSELx_Px_8_bm		(3UL<<16)
#define PINSELx_Px_9_bm		(3UL<<18)
#define PINSELx_Px_10_bm	(3UL<<20)
#define PINSELx_Px_11_bm	(3UL<<22)
#define PINSELx_Px_12_bm	(3UL<<24)
#define PINSELx_Px_13_bm	(3UL<<26)
#define PINSELx_Px_14_bm	(3UL<<28)
#define PINSELx_Px_15_bm	(3UL<<30)
#define PINSELx_Px_16_bm	(3UL<<0)
#define PINSELx_Px_17_bm	(3UL<<2)
#define PINSELx_Px_18_bm	(3UL<<4)
#define PINSELx_Px_19_bm	(3UL<<6)
#define PINSELx_Px_20_bm	(3UL<<8)
#define PINSELx_Px_21_bm	(3UL<<10)
#define PINSELx_Px_22_bm	(3UL<<12)
#define PINSELx_Px_23_bm	(3UL<<14)
#define PINSELx_Px_24_bm	(3UL<<16)
#define PINSELx_Px_25_bm	(3UL<<18)
#define PINSELx_Px_26_bm	(3UL<<20)
#define PINSELx_Px_27_bm	(3UL<<22)
#define PINSELx_Px_28_bm	(3UL<<24)
#define PINSELx_Px_29_bm	(3UL<<26)
#define PINSELx_Px_30_bm	(3UL<<28)
#define PINSELx_Px_31_bm	(3UL<<30)

#define PINSELx_Px_0_bp		(0)
#define PINSELx_Px_1_bp		(2)
#define PINSELx_Px_2_bp		(4)
#define PINSELx_Px_3_bp		(6)
#define PINSELx_Px_4_bp		(8)
#define PINSELx_Px_5_bp		(10)
#define PINSELx_Px_6_bp		(12)
#define PINSELx_Px_7_bp		(14)
#define PINSELx_Px_8_bp		(16)
#define PINSELx_Px_9_bp		(18)
#define PINSELx_Px_10_bp	(20)
#define PINSELx_Px_11_bp	(22)
#define PINSELx_Px_12_bp	(24)
#define PINSELx_Px_13_bp	(26)
#define PINSELx_Px_14_bp	(28)
#define PINSELx_Px_15_bp	(30)
#define PINSELx_Px_16_bp	(0)
#define PINSELx_Px_17_bp	(2)
#define PINSELx_Px_18_bp	(4)
#define PINSELx_Px_19_bp	(6)
#define PINSELx_Px_20_bp	(8)
#define PINSELx_Px_21_bp	(10)
#define PINSELx_Px_22_bp	(12)
#define PINSELx_Px_23_bp	(14)
#define PINSELx_Px_24_bp	(16)
#define PINSELx_Px_25_bp	(18)
#define PINSELx_Px_26_bp	(20)
#define PINSELx_Px_27_bp	(22)
#define PINSELx_Px_28_bp	(24)
#define PINSELx_Px_29_bp	(26)
#define PINSELx_Px_30_bp	(28)
#define PINSELx_Px_31_bp	(30)


/* Register Definition of Pin Mode Select register 0~9 */
typedef enum PINMODEx_enum
{
	PINMODEx_PULLUP			= (0UL),
	PINMODEx_FLOATING		= (2UL),
	PINMODEx_PULLDOWN		= (3UL),
} PINMODEx_t;
#define PINMODEx_ALL_bm		(0xFFFFFFFFUL)
#define PINMODEx_Px_0_bm	(3UL<<0)
#define PINMODEx_Px_1_bm	(3UL<<2)
#define PINMODEx_Px_2_bm	(3UL<<4)
#define PINMODEx_Px_3_bm	(3UL<<6)
#define PINMODEx_Px_4_bm	(3UL<<8)
#define PINMODEx_Px_5_bm	(3UL<<10)
#define PINMODEx_Px_6_bm	(3UL<<12)
#define PINMODEx_Px_7_bm	(3UL<<14)
#define PINMODEx_Px_8_bm	(3UL<<16)
#define PINMODEx_Px_9_bm	(3UL<<18)
#define PINMODEx_Px_10_bm	(3UL<<20)
#define PINMODEx_Px_11_bm	(3UL<<22)
#define PINMODEx_Px_12_bm	(3UL<<24)
#define PINMODEx_Px_13_bm	(3UL<<26)
#define PINMODEx_Px_14_bm	(3UL<<28)
#define PINMODEx_Px_15_bm	(3UL<<30)
#define PINMODEx_Px_16_bm	(3UL<<0)
#define PINMODEx_Px_17_bm	(3UL<<2)
#define PINMODEx_Px_18_bm	(3UL<<4)
#define PINMODEx_Px_19_bm	(3UL<<6)
#define PINMODEx_Px_20_bm	(3UL<<8)
#define PINMODEx_Px_21_bm	(3UL<<10)
#define PINMODEx_Px_22_bm	(3UL<<12)
#define PINMODEx_Px_23_bm	(3UL<<14)
#define PINMODEx_Px_24_bm	(3UL<<16)
#define PINMODEx_Px_25_bm	(3UL<<18)
#define PINMODEx_Px_26_bm	(3UL<<20)
#define PINMODEx_Px_27_bm	(3UL<<22)
#define PINMODEx_Px_28_bm	(3UL<<24)
#define PINMODEx_Px_29_bm	(3UL<<26)
#define PINMODEx_Px_30_bm	(3UL<<28)
#define PINMODEx_Px_31_bm	(3UL<<30)


/* Register Definition of GPIO port Direction register */
typedef enum IOxDIR_enum
{
	IOxDIR_INPUT		= (0UL),
	IOxDIR_OUTPUT		= (1UL),
} IOxDIR_t;


/* Register Definition of GPIO overall Interrupt Status register */
typedef enum IOIntStatus_enum
{ 
	P0Int_NO_PEND_INT		= (0UL<<0), /* There are no pending interrupts on PORT0. */
	P0Int_PENDED_INT		= (1UL<<0), /* There is at least one pending interrupt on PORT0. */
	P2Int_NO_PEND_INT		= (0UL<<2), /* There are no pending interrupts on PORT2. */
	P2Int_PENDED_INT		= (1UL<<2), /* There is at least one pending interrupt on PORT2. */
} IOIntStatus_t;


/* Register Definition of GPIO Interrupt Enable for Rising edge register */
/* Register Definition of GPIO Interrupt Enable for Rising edge register */
/* Register Definition of GPIO Interrupt Enable for Falling edge register */
/* Register Definition of GPIO Interrupt Enable for Falling edge register */
/* Register Definition of GPIO Status for Rising edge register */
/* Register Definition of GPIO Status for Falling edge register */
/* Register Definition of GPIO Interrupt Clear register */
/* Register Definition of GPIO overall Interrupt Status register */

/* Register Definition of GPIO Registers */
/* GPIO Bit Position Defines 32bit */
#define GPIO_Px_0_bp		(0)
#define GPIO_Px_1_bp		(1)
#define GPIO_Px_2_bp		(2)
#define GPIO_Px_3_bp		(3)
#define GPIO_Px_4_bp		(4)
#define GPIO_Px_5_bp		(5)
#define GPIO_Px_6_bp		(6)
#define GPIO_Px_7_bp		(7)
#define GPIO_Px_8_bp		(8)
#define GPIO_Px_9_bp		(9)
#define GPIO_Px_10_bp		(10)
#define GPIO_Px_11_bp		(11)
#define GPIO_Px_12_bp		(12)
#define GPIO_Px_13_bp		(13)
#define GPIO_Px_14_bp		(14)
#define GPIO_Px_15_bp		(15)
#define GPIO_Px_16_bp		(16)
#define GPIO_Px_17_bp		(17)
#define GPIO_Px_18_bp		(18)
#define GPIO_Px_19_bp		(19)
#define GPIO_Px_20_bp		(20)
#define GPIO_Px_21_bp		(21)
#define GPIO_Px_22_bp		(22)
#define GPIO_Px_23_bp		(23)
#define GPIO_Px_24_bp		(24)
#define GPIO_Px_25_bp		(25)
#define GPIO_Px_26_bp		(26)
#define GPIO_Px_27_bp		(27)
#define GPIO_Px_28_bp		(28)
#define GPIO_Px_29_bp		(29)
#define GPIO_Px_30_bp		(30)
#define GPIO_Px_31_bp		(31)
/* GPIO Bit Mask Defines 32bit */
#define GPIO_Px_0_bm		(1UL<<0)
#define GPIO_Px_1_bm		(1UL<<1)
#define GPIO_Px_2_bm		(1UL<<2)
#define GPIO_Px_3_bm		(1UL<<3)
#define GPIO_Px_4_bm		(1UL<<4)
#define GPIO_Px_5_bm		(1UL<<5)
#define GPIO_Px_6_bm		(1UL<<6)
#define GPIO_Px_7_bm		(1UL<<7)
#define GPIO_Px_8_bm		(1UL<<8)
#define GPIO_Px_9_bm		(1UL<<9)
#define GPIO_Px_10_bm		(1UL<<10)
#define GPIO_Px_11_bm		(1UL<<11)
#define GPIO_Px_12_bm		(1UL<<12)
#define GPIO_Px_13_bm		(1UL<<13)
#define GPIO_Px_14_bm		(1UL<<14)
#define GPIO_Px_15_bm		(1UL<<15)
#define GPIO_Px_16_bm		(1UL<<16)
#define GPIO_Px_17_bm		(1UL<<17)
#define GPIO_Px_18_bm		(1UL<<18)
#define GPIO_Px_19_bm		(1UL<<19)
#define GPIO_Px_20_bm		(1UL<<20)
#define GPIO_Px_21_bm		(1UL<<21)
#define GPIO_Px_22_bm		(1UL<<22)
#define GPIO_Px_23_bm		(1UL<<23)
#define GPIO_Px_24_bm		(1UL<<24)
#define GPIO_Px_25_bm		(1UL<<25)
#define GPIO_Px_26_bm		(1UL<<26)
#define GPIO_Px_27_bm		(1UL<<27)
#define GPIO_Px_28_bm		(1UL<<28)
#define GPIO_Px_29_bm		(1UL<<29)
#define GPIO_Px_30_bm		(1UL<<30)
#define GPIO_Px_31_bm		(1UL<<31)


/* GPIO Bit Position Defines 16bit */
#define GPIO_PxL_0_bp		(0)
#define GPIO_PxL_1_bp		(1)
#define GPIO_PxL_2_bp		(2)
#define GPIO_PxL_3_bp		(3)
#define GPIO_PxL_4_bp		(4)
#define GPIO_PxL_5_bp		(5)
#define GPIO_PxL_6_bp		(6)
#define GPIO_PxL_7_bp		(7)
#define GPIO_PxL_8_bp		(8)
#define GPIO_PxL_9_bp		(9)
#define GPIO_PxL_10_bp		(10)
#define GPIO_PxL_11_bp		(11)
#define GPIO_PxL_12_bp		(12)
#define GPIO_PxL_13_bp		(13)
#define GPIO_PxL_14_bp		(14)
#define GPIO_PxL_15_bp		(15)
/* GPIO Bit Mask Defines 16bit */
#define GPIO_PxL_bm			(0x0000FFFFUL)
#define GPIO_PxL_0_bm		(1UL<<0)
#define GPIO_PxL_1_bm		(1UL<<1)
#define GPIO_PxL_2_bm		(1UL<<2)
#define GPIO_PxL_3_bm		(1UL<<3)
#define GPIO_PxL_4_bm		(1UL<<4)
#define GPIO_PxL_5_bm		(1UL<<5)
#define GPIO_PxL_6_bm		(1UL<<6)
#define GPIO_PxL_7_bm		(1UL<<7)
#define GPIO_PxL_8_bm		(1UL<<8)
#define GPIO_PxL_9_bm		(1UL<<9)
#define GPIO_PxL_10_bm		(1UL<<10)
#define GPIO_PxL_11_bm		(1UL<<11)
#define GPIO_PxL_12_bm		(1UL<<12)
#define GPIO_PxL_13_bm		(1UL<<13)
#define GPIO_PxL_14_bm		(1UL<<14)
#define GPIO_PxL_15_bm		(1UL<<15)
#define GPIO_PxL_16_bm		(1UL<<16)

/* GPIO Bit Position Defines 16bit */
#define GPIO_PxH_0_bp		(0)
#define GPIO_PxH_1_bp		(1)
#define GPIO_PxH_2_bp		(2)
#define GPIO_PxH_3_bp		(3)
#define GPIO_PxH_4_bp		(4)
#define GPIO_PxH_5_bp		(5)
#define GPIO_PxH_6_bp		(6)
#define GPIO_PxH_7_bp		(7)
#define GPIO_PxH_8_bp		(8)
#define GPIO_PxH_9_bp		(9)
#define GPIO_PxH_10_bp		(10)
#define GPIO_PxH_11_bp		(11)
#define GPIO_PxH_12_bp		(12)
#define GPIO_PxH_13_bp		(13)
#define GPIO_PxH_14_bp		(14)
#define GPIO_PxH_15_bp		(15)
/* GPIO Bit Mask Defines 16bit */
#define GPIO_PxH_bm			(0xFFFF0000UL)
#define GPIO_PxH_0_bm		(1UL<<0)
#define GPIO_PxH_1_bm		(1UL<<1)
#define GPIO_PxH_2_bm		(1UL<<2)
#define GPIO_PxH_3_bm		(1UL<<3)
#define GPIO_PxH_4_bm		(1UL<<4)
#define GPIO_PxH_5_bm		(1UL<<5)
#define GPIO_PxH_6_bm		(1UL<<6)
#define GPIO_PxH_7_bm		(1UL<<7)
#define GPIO_PxH_8_bm		(1UL<<8)
#define GPIO_PxH_9_bm		(1UL<<9)
#define GPIO_PxH_10_bm		(1UL<<10)
#define GPIO_PxH_11_bm		(1UL<<11)
#define GPIO_PxH_12_bm		(1UL<<12)
#define GPIO_PxH_13_bm		(1UL<<13)
#define GPIO_PxH_14_bm		(1UL<<14)
#define GPIO_PxH_15_bm		(1UL<<15)
#define GPIO_PxH_16_bm		(1UL<<16)


