yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
/* GPIO Bit Position Defines 8bit */
#define GPIO_Px0_0_bp		(0)
#define GPIO_Px0_1_bp		(1)
#define GPIO_Px0_2_bp		(2)
#define GPIO_Px0_3_bp		(3)
#define GPIO_Px0_4_bp		(4)
#define GPIO_Px0_5_bp		(5)
#define GPIO_Px0_6_bp		(6)
#define GPIO_Px0_7_bp		(7)
/* GPIO Bit Mask Defines 8bit */
#define GPIO_Px0_bm			(0x000000FFUL)
#define GPIO_Px0_0_bm		(1UL<<0)
#define GPIO_Px0_1_bm		(1UL<<1)
#define GPIO_Px0_2_bm		(1UL<<2)
#define GPIO_Px0_3_bm		(1UL<<3)
#define GPIO_Px0_4_bm		(1UL<<4)
#define GPIO_Px0_5_bm		(1UL<<5)
#define GPIO_Px0_6_bm		(1UL<<6)
#define GPIO_Px0_7_bm		(1UL<<7)

/* GPIO Bit Position Defines 8bit */
#define GPIO_Px1_0_bp		(0)
#define GPIO_Px1_1_bp		(1)
#define GPIO_Px1_2_bp		(2)
#define GPIO_Px1_3_bp		(3)
#define GPIO_Px1_4_bp		(4)
#define GPIO_Px1_5_bp		(5)
#define GPIO_Px1_6_bp		(6)
#define GPIO_Px1_7_bp		(7)
/* GPIO Bit Mask Defines 8bit */
#define GPIO_Px1_bm			(0x0000FF00UL)
#define GPIO_Px1_0_bm		(1UL<<0)
#define GPIO_Px1_1_bm		(1UL<<1)
#define GPIO_Px1_2_bm		(1UL<<2)
#define GPIO_Px1_3_bm		(1UL<<3)
#define GPIO_Px1_4_bm		(1UL<<4)
#define GPIO_Px1_5_bm		(1UL<<5)
#define GPIO_Px1_6_bm		(1UL<<6)
#define GPIO_Px1_7_bm		(1UL<<7)

/* GPIO Bit Position Defines 8bit */
#define GPIO_Px2_0_bp		(0)
#define GPIO_Px2_1_bp		(1)
#define GPIO_Px2_2_bp		(2)
#define GPIO_Px2_3_bp		(3)
#define GPIO_Px2_4_bp		(4)
#define GPIO_Px2_5_bp		(5)
#define GPIO_Px2_6_bp		(6)
#define GPIO_Px2_7_bp		(7)
/* GPIO Bit Mask Defines 8bit */
#define GPIO_Px2_bm			(0x00FF0000UL)
#define GPIO_Px2_0_bm		(1UL<<0)
#define GPIO_Px2_1_bm		(1UL<<1)
#define GPIO_Px2_2_bm		(1UL<<2)
#define GPIO_Px2_3_bm		(1UL<<3)
#define GPIO_Px2_4_bm		(1UL<<4)
#define GPIO_Px2_5_bm		(1UL<<5)
#define GPIO_Px2_6_bm		(1UL<<6)
#define GPIO_Px2_7_bm		(1UL<<7)

/* GPIO Bit Position Defines 8bit */
#define GPIO_Px3_0_bp		(0)
#define GPIO_Px3_1_bp		(1)
#define GPIO_Px3_2_bp		(2)
#define GPIO_Px3_3_bp		(3)
#define GPIO_Px3_4_bp		(4)
#define GPIO_Px3_5_bp		(5)
#define GPIO_Px3_6_bp		(6)
#define GPIO_Px3_7_bp		(7)
/* GPIO Bit Mask Defines 8bit */
#define GPIO_Px3_bm			(0xFF000000UL)
#define GPIO_Px3_0_bm		(1UL<<0)
#define GPIO_Px3_1_bm		(1UL<<1)
#define GPIO_Px3_2_bm		(1UL<<2)
#define GPIO_Px3_3_bm		(1UL<<3)
#define GPIO_Px3_4_bm		(1UL<<4)
#define GPIO_Px3_5_bm		(1UL<<5)
#define GPIO_Px3_6_bm		(1UL<<6)
#define GPIO_Px3_7_bm		(1UL<<7)

/* UARTn Receiver Buffer Register */
/* UARTn Transmit Holding Register */
/* UARTn Divisor Latch LSB Register */
/* UARTn Interrupt Enable Register */
typedef enum UxIER_enum
{ 
	UxIER_RBR_INT_EN			= (1UL<<0), /* enables the Receive Data Available interrupt for UARTn. */
	UxIER_RBR_INT_DIS			= (0UL<<0), /* disables the Receive Data Available interrupt for UARTn. */
	UxIER_THRE_INT_EN			= (1UL<<1), /* enables the THRE interrupt for UARTn. */
	UxIER_THRE_INT_DIS			= (0UL<<1), /* disables the THRE interrupt for UARTn. */
	UxIER_RXLINE_INT_EN			= (1UL<<2), /* enables the UARTn RX line status interrupts. */
	UxIER_RXLINE_INT_DIS		= (0UL<<2), /* disables the UARTn RX line status interrupts. */
	UxIER_ABEO_INT_EN			= (1UL<<8), /* enables the end of auto-baud interrupt. */
	UxIER_ABEO_INT_DIS			= (0UL<<8), /* disables the end of auto-baud interrupt. */
	UxIER_ABTO_INT_EN			= (1UL<<9), /* enables the auto-baud time-out interrupt. */
	UxIER_ABTO_INT_DIS			= (0UL<<9), /* disables the auto-baud time-out interrupt. */
} UxIER_t;

/* UARTn Interrupt Identification Register */
typedef enum UxIIR_enum
{ 
	UxIIR_INT_NO_PENDING		= (0UL<<0), /* No interrupt is pending. */
	UxIIR_INT_PENDING			= (1UL<<0), /* Interrupt status. Note that U1IIR[0] is active low. The
												pending interrupt can be determined by evaluating
												UnIIR[3:1].  At least one interrupt is pending.*/
	UxIIR_INTLD_RLS				= (3UL<<1), /* Interrupt identification.Receive Line Status. */
	UxIIR_INTLD_RDA				= (2UL<<1), /* Interrupt identification.Receive Data Available. */
	UxIIR_INTLD_CTI 			= (6UL<<1), /* Character Time-out Indicator. */
	UxIIR_INTLD_THRE			= (1UL<<1), /* THRE Interrupt */
	UxIIR_INTLD_FIFO_EN			= (3UL<<6), /* These bits are equivalent to UnFCR[0]. */
	UxIIR_INT_ABEO				= (1UL<<8), /* True if auto-baud has finished successfully and interrupt is enabled */
	UxIIR_INT_ABTO				= (1UL<<9), /* True if auto-baud has timed out and interrupt is enabled. */
} UxIIR_t;

/* UARTn FIFO Control Register */
typedef enum UxFCR_enum
{ 
	UxFCR_FIFO_EN			= (1UL<<0), /* UARTn FIFOs are disabled. 
	                                       Must not be used in the application. */
	UxFCR_FIFO_DIS			= (0UL<<0), /* Active high enable for both UARTn Rx and TX
										   FIFOs and UnFCR[7:1] access. This bit must be set
										   for proper UARTn operation. Any transition on this
										   bit will automatically clear the UARTn FIFOs. */
	UxFCR_RX_RESET			= (1UL<<1), /* Writing a logic 1 to UnFCR[1] will clear all bytes in
										   UARTn Rx FIFO and reset the pointer logic. This bit
										   is self-clearing. */
	UxFCR_TX_RESET			= (1UL<<2), /* Writing a logic 1 to UnFCR[2] will clear all bytes in
										   UARTn TX FIFO and reset the pointer logic. This bit
										   is self-clearing. */
    UxFCR_RX_TRG_REVEL0     = (0UL<<6), /* These two bits determine how many receiver      */
    UxFCR_RX_TRG_REVEL1     = (1UL<<6), /* UARTn FIFO characters must be written before an */
    UxFCR_RX_TRG_REVEL2     = (2UL<<6), /* interrupt is activated.                         */
    UxFCR_RX_TRG_REVEL3     = (3UL<<6),
} UxFCR_t;

/* UARTn Line Control Register */
typedef enum UxLCR_enum
{ 
	UxLCR_CHR_5BIT			= (0UL<<0), /* 5 bit character length. */
	UxLCR_CHR_6BIT			= (1UL<<0), /* 6 bit character length. */
	UxLCR_CHR_7BIT			= (2UL<<0), /* 7 bit character length. */
	UxLCR_CHR_8BIT			= (3UL<<0), /* 8 bit character length. */
	UxLCR_1STOPBIT			= (0UL<<2), /* 1 stop bit. */
	UxLCR_2STOPBIT			= (1UL<<2), /* 2 stop bits (1.5 if UnLCR[1:0]=00). */
	UxLCR_PARITYBIT_DIS		= (0UL<<3), /* Disable parity generation and checking. */
	UxLCR_PARITYBIT_EN		= (1UL<<3), /* Enable parity generation and checking. */
	UxLCR_ODD_PARITY		= (0UL<<4), /* Odd parity. Number of 1s in the transmitted character and
										   the attached parity bit will be odd. */
	UxLCR_EVEN_PARITY		= (1UL<<4), /* Even Parity. Number of 1s in the transmitted character and
										   the attached parity bit will be even. */
	UxLCR_PARITY_ONE_FORCE  = (2UL<<4), /* Forced "1" stick parity. */
	UxLCR_PARITY_ZERO_FORCE = (3UL<<4), /* Forced "0" stick parity. */
	UxLCR_BREAK_DIS			= (0UL<<6), /* Disable break transmission. */
	UxLCR_BREAK_EN			= (1UL<<6), /* Enable break transmission. Output pin UART0 TXD is
										   forced to logic 0 when UnLCR[6] is active high. */
	UxLCR_DIVISOR_DIS		= (0UL<<7), /* Disable access to Divisor Latches. */
	UxLCR_DIVISOR_EN		= (1UL<<7), /* Enable access to Divisor Latches. */
} UxLCR_t;

/* UARTn Line Status Register */
typedef enum UxLSR_enum
{ 
	UxLSR_RDR				= (1UL<<0), /* UnRBR contains valid data. */
	UxLSR_OE				= (1UL<<1), /* Overrun error status is active. */
	UxLSR_PE				= (1UL<<2), /* Parity error status is active. */
	UxLSR_FE				= (1UL<<3), /* Framing error status is active. */
	UxLSR_BI				= (1UL<<4), /* Break interrupt status is active. */
	UxLSR_THRE				= (1UL<<5), /* UnTHR is empty.*/
	UxLSR_TEMT				= (1UL<<6), /* UnTHR and the UnTSR are empty. */
	UxLSR_RXFE				= (1UL<<7), /* UARTn RBR contains at least one UARTn RX error. */
} UxLSR_t;

