yasunoxx/evLPC2388/srcs/test03/include/LPC23xx_reg.h
/* UARTn Scratch Pad Register */

/* UARTn Auto-baud Control Register */
typedef enum UxACR_enum
{ 
	UxACR_STOP				= (0UL<<0), /* Auto-baud stop (auto-baud is not running). */
	UxACR_START				= (1UL<<0), /* Auto-baud start (auto-baud is running).Auto-baud run
								           bit. This bit is automatically cleared after auto-baud
										   completion. */
	UxACR_MODE0				= (0UL<<1), /* Auto-baud mode 0 */
	UxACR_MODE1				= (1UL<<1), /* Auto-baud mode 1 */
	UxACR_RESTART_OFF		= (0UL<<2), /* No restart. */
	UxACR_RESTART_ON		= (1UL<<2), /* Restart in case of time-out (counter restarts at next
										   UART0 Rx falling edge) */
	UxACR_ABEO_INTCLR		= (0UL<<8), /* End of auto-baud interrupt clear bit (write only accessible). */
	UxACR_ABTO_INTCLR		= (1UL<<9), /* Auto-baud time-out interrupt clear bit (write only accessible). */
} UxACR_t;

/* IrDA Control Register for UART3 only */
typedef enum U3ICR_enum
{ 
	U3ICR_IRDA_DIS			= (0UL<<0), /* IrDA mode on UART3 is disabled, */
	U3ICR_IRDA_EN			= (1UL<<0), /* IrDA mode on UART3 is enabled, */
	U3ICR_POL_NOMAL			= (0UL<<1), /* IrDA input is not  inverted, */
	U3ICR_POL_INV			= (1UL<<1), /* IrDA input is inverted, */
	U3ICR_FIXPULSE_DIS		= (0UL<<2), /* When 1, enabled IrDA fixed pulse width mode. */
	U3ICR_FIXPULSE_EN		= (1UL<<2), /* When 1, enabled IrDA fixed pulse width mode. */
	U3ICR_PULSEDIV_2		= (0UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_4		= (1UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_8		= (2UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_16		= (3UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_32		= (4UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_64		= (5UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_128		= (6UL<<3), /* Configures the pulse when FixPulseEn = 1. */
	U3ICR_PULSEDIV_256		= (7UL<<3), /* Configures the pulse when FixPulseEn = 1. */
} U3ICR_t;

/* UARTn Fractional Divider Register */

/* UARTn Transmit Enable Register */
typedef enum UxTER_enum
{ 
	UxTER_TXDIS				= (0UL<<7), /* UART Tx disable. */
	UxTER_TXEN				= (1UL<<7), /* UART Tx enable. */
} UxTER_t;




/* EtherNet MAC */
/* Register Definition of MAC configuration register 1 */
typedef enum MAC1_enum
{
	MAC1_RECEIVE_ENABLE						= (1UL<<0),
	MAC1_RECEIVE_DISABLE  					= (0UL<<0),
	MAC1_PASS_ALL_RECEIVE_FRAMES_ENABLE		= (1UL<<1),
	MAC1_PASS_ALL_RECEIVE_FRAMES_DISABLE	= (0UL<<1),
	MAC1_RX_FLOW_CONTROL_ENABLE				= (1UL<<2),
	MAC1_RX_FLOW_CONTROL_DISABLE  			= (0UL<<2),
	MAC1_TX_FLOW_CONTROL_ENABLE				= (1UL<<3),
	MAC1_TX_FLOW_CONTROL_DISABLE  			= (0UL<<3),
	MAC1_LOOPBACK_MODE						= (1UL<<4),
	MAC1_NOMAL_OPERATION_MODE				= (0UL<<4),
	MAC1_RESET_TX_ENABLE					= (1UL<<8),
	MAC1_RESET_TX_DISABLE  					= (0UL<<8),
	MAC1_RESET_MCS_TX_ENABLE				= (1UL<<9),
	MAC1_RESET_MCS_TX_DISABLE  				= (0UL<<9),
	MAC1_RESET_RX_ENABLE					= (1UL<<10),
	MAC1_RESET_RX_DISABLE  					= (0UL<<10),
	MAC1_RESET_MCS_RX_ENABLE				= (1UL<<11),
	MAC1_RESET_MCS_RX_DISABLE  				= (0UL<<11),
	MAC1_SIMULATION_RESET_ENABLE			= (1UL<<14),
	MAC1_SIMULATION_RESET_DISABLE			= (0UL<<14),
	MAC1_SOFT_RESET_ENABLE					= (1UL<<15),
	MAC1_SOFT_RESET_DISABLE					= (0UL<<15),
} MAC1_t;
#define MAC1_RECEIVE_bm						(1UL<<0)
#define MAC1_PASS_ALL_RECEIVE_FRAMES_bm		(1UL<<1)
#define MAC1_RX_FLOW_CONTROL_bm				(1UL<<2)
#define MAC1_TX_FLOW_CONTROL_bm				(1UL<<3)
#define MAC1_OPERATION_MODE_bm				(1UL<<4)
#define MAC1_RESET_TX_bm					(1UL<<8)
#define MAC1_RESET_MCS_TX_bm				(1UL<<9)
#define MAC1_RESET_RX_bm					(1UL<<10)
#define MAC1_RESET_MCS_RX_bm				(1UL<<11)
#define MAC1_SIMULATION_RESET_bm			(1UL<<14)
#define MAC1_SOFT_RESET_bm					(1UL<<15)


/* Register Definition of MAC configuration register 2 */
typedef enum MAC2_enum
{
	MAC2_FULL_DUPLEX						= (1UL<<0),
	MAC2_HALF_DUPLEX  						= (0UL<<0),
	MAC2_FRAME_LENGTH_CHECKING_ENABLE		= (1UL<<1),
	MAC2_FRAME_LENGTH_CHECKING_DISABLE		= (0UL<<1),
	MAC2_HUGE_FRAME_ENABLE					= (1UL<<2),
	MAC2_HUGE_FRAME_DISABLE  				= (0UL<<2),
	MAC2_DELAYED_CRC_ENABLE					= (1UL<<3),
	MAC2_DELAYED_CRC_DISABLE  				= (0UL<<3),
	MAC2_CRC_ENABLE							= (1UL<<4),
	MAC2_CRC_DISABLE						= (0UL<<4),
	MAC2_PAD_CRC_ENABLE						= (1UL<<5),
	MAC2_PAD_CRC_DISABLE  					= (0UL<<5),
	MAC2_VLAN_PAD_ENABLE					= (1UL<<6),
	MAC2_VLAN_PAD_DISABLE  					= (0UL<<6),
	MAC2_AUTO_DETECT_PAD_ENABLE				= (1UL<<7),
	MAC2_AUTO_DETECT_PAD_DISABLE  			= (0UL<<7),
	MAC2_PURE_PREAMBLE_ENFORCEMENT_ENABLE	= (1UL<<8),
	MAC2_PURE_PREAMBLE_ENFORCEMENT_DISABLE  = (0UL<<8),
	MAC2_LONG_PREAMBLE_ENFORCEMENT_ENABLE	= (1UL<<9),
	MAC2_LONG_PREAMBLE_ENFORCEMENT_DISABLE  = (0UL<<9),
	MAC2_NO_BACKOFF_ENABLE					= (1UL<<12),
	MAC2_NO_BACKOFF_DISABLE					= (0UL<<12),
	MAC2_BACK_PRESSURE_NO_BACKOFF_ENABLE	= (1UL<<13),
	MAC2_BACK_PRESSURE_NO_BACKOFF_DISABLE	= (0UL<<14),
	MAC2_EXCESS_DEFER_ENABLE				= (1UL<<14),
	MAC2_EXCESS_DEFER_DISABLE				= (0UL<<14),
} MAC2_t;
#define MAC2_FULL_DUPLEX					(1UL<<0)
#define MAC2_FRAME_LENGTH_CHECKING_bm		(1UL<<1)
#define MAC2_HUGE_FRAME_bm					(1UL<<2)
#define MAC2_DELAYED_CRC_bm					(1UL<<3)
#define MAC2_CRC_bm							(1UL<<4)
#define MAC2_PAD_CRC_bm						(1UL<<5)
#define MAC2_VLAN_PAD_bm					(1UL<<6)
#define MAC2_AUTO_DETECT_PAD_bm				(1UL<<7)
#define MAC2_PURE_PREAMBLE_ENFORCEMENT_bm	(1UL<<8)
#define MAC2_LONG_PREAMBLE_ENFORCEMENT_bm	(1UL<<9)
#define MAC2_NO_BACKOFF_bm					(1UL<<12)
#define MAC2_BACK_PRESSURE_NO_BACKOFF_bm	(1UL<<13)
#define MAC2_EXCESS_DEFER_bm				(1UL<<14)

/*~~~ret al~~~*/


#define SetMMRVal(MMR_REG,BIT_MASK,BIT_BALUE)	\
		MMR_REG = ( (MMR_REG & ~(BIT_MASK))| BIT_BALUE )



#ifdef __cplusplus
}
#endif

#endif /* __LPC23xx_REG_H */
